# usr/bin/python3
# -*- coding:utf-8 -*-
# Authour:Dreamer
# Tmie:2018.6.1

"""

题目2：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高
于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提
成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于
40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于
100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

# bonus10 = 100000*0.1
# bonus20 = bonus10 + 100000 * 0.075
# bonus40 = bonus20 + 200000 * 0.05
# bonus60 = bonus40 + 200000 * 0.03
# bonus100 = bonus60 + 400000 * 0.015　
　　　　　
"""
# 奖金：bonus

bonus10 = 100000*0.1
bonus20 = bonus10 + 100000 * 0.075
bonus40 = bonus20 + 200000 * 0.05
bonus60 = bonus40 + 200000 * 0.03
bonus100 = bonus60 + 400000 * 0.015

I = int(input("Please input the gain:"))
if I <= 10000:
    bonus = I * 0.1
elif I <= 200000:
    bonus = bonus10 + (I-100000) * 0.075
elif I <= 400000:
    bonus = bonus20 + (I-200000) * 0.05
elif I <= 600000:
    bonus = bonus40 + (I-400000) * 0.03
elif I <= 1000000:
    bonus = bonus60 + (I-600000) * 0.015
else:
    bonus = bonus100 + (I  - 1000000) * 0.01
print("bonus = ",bonus)
